app/Livewire/Highscale/HighScaleReport.php

    public function tableData()
    {
        if (!empty($this->from_date)) {
            $this->from_gregorianDate = $this->shamsiToGregorian($this->from_date);
        }

        if (!empty($this->to_date)) {
            $this->to_gregorianDate = $this->shamsiToGregorian($this->to_date);
        }
        $this->show_data = true;

        $data =
            Weight::with(['scale', 'customer', 'minral', 'purchase'])
            ->when(auth()->user()->position != 1, function ($query) {
                $query->where('provinces.province_code', auth()->user()->province_id);
            })
            ->when($this->search !== '', function ($query) {
                $query->where('weight.bill_id', '=', $this->search);
            })
            ->when($this->from_date !== null && $this->to_date !== null, function ($query) {
                $query->whereBetween('weight.created_at', [$this->from_gregorianDate, $this->to_gregorianDate]);
            })
            ->when($this->from_date !== null && $this->to_date == null, function ($query) {
                $query->whereBetween('weight.created_at', [$this->from_gregorianDate, now()]);
            })
            ->when($this->catProvince && count($this->catProvince) > 0, function ($query) {
                $query->whereIn('provinces.province_code', $this->catProvince);
            })
            ->when($this->catScale && count($this->catScale) > 0, function ($query) {
                $query->whereIn('weight.scale_id', $this->catScale);
            })
            ->when($this->catMineral && count($this->catMineral) > 0, function ($query) {
                $query->whereIn('weight.mineral_id', $this->catMineral);
            })
            ->leftJoin('minrals', 'weight.mineral_id', '=', 'minrals.id')
            ->leftJoin('purchase', 'weight.purchase_id', '=', 'purchase.id')
            ->leftJoin('customers', 'purchase.customer_id', '=', 'customers.id')
            ->leftJoin('scale', 'weight.scale_id', '=', 'scale.id')
            ->leftJoin('provinces', 'scale.department_id', '=', 'provinces.province_code')
            ->select(
                'customers.name AS customer_name',
                'minrals.minral_name',
                'scale.name AS scale_name',
                'provinces.name AS province_name',
                'weight.unit_id AS unit_id',
                DB::raw('SUM(weight.mineral_net_weight) AS mineral_net_weight'),
                DB::raw('COUNT(weight.id) AS cars'),
                DB::raw('MIN(weight.created_at) AS from_date'),
                DB::raw('MAX(weight.created_at) AS to_date'),
                DB::raw('SUM(CASE WHEN weight.discharge_place = "CHECKED" THEN 200 ELSE weight.mineral_net_weight * 10 END) AS Total_Revenue')
            )
            ->groupBy('customers.id', 'weight.mineral_id', 'weight.scale_id')
            ->orderBy($this->sortField, $this->sortDirection)
            ->simplePaginate($this->perPage ? $this->perPage : 10);
---
select `customers`.`name` as `customer_name`, `minrals`.`minral_name`, `scale`.`name` as `scale_name`, `provinces`.`name` as `province_name`, `weight`.`unit_id` as `unit_id`, SUM(weight.mineral_net_weight) AS mineral_net_weight, COUNT(weight.id) AS cars, MIN(weight.created_at) AS from_date, MAX(weight.created_at) AS to_date, SUM(CASE WHEN weight.discharge_place = "CHECKED" THEN 200 ELSE weight.mineral_net_weight * 10 END) AS Total_Revenue from `weight` left join `minrals` on `weight`.`mineral_id` = `minrals`.`id` left join `purchase` on `weight`.`purchase_id` = `purchase`.`id` left join `customers` on `purchase`.`customer_id` = `customers`.`id` left join `scale` on `weight`.`scale_id` = `scale`.`id` left join `provinces` on `scale`.`department_id` = `provinces`.`province_code` group by `customers`.`id`, `weight`.`mineral_id`, `weight`.`scale_id` order by `weight`.`date` desc limit 11 offset 0

    public function exportToExcel()
    {
        $data = Weight::with(['scale', 'customer', 'minral', 'purchase'])
            ->when(auth()->user()->position != 1, function ($query) {
                $query->where('provinces.province_code', auth()->user()->province_id);
            })
            ->when($this->search !== '', function ($query) {
                $query->where('weight.bill_id', '=', $this->search);
            })
            ->when($this->from_date !== null && $this->to_date !== null, function ($query) {
                $query->whereBetween('weight.created_at', [$this->from_gregorianDate, $this->to_gregorianDate]);
            })
            ->when($this->from_date !== null && $this->to_date == null, function ($query) {
                $query->whereBetween('weight.created_at', [$this->from_gregorianDate, now()]);
            })
            ->when($this->catProvince && count($this->catProvince) > 0, function ($query) {
                $query->whereIn('provinces.province_code', $this->catProvince);
            })
            ->when($this->catScale && count($this->catScale) > 0, function ($query) {
                $query->whereIn('weight.scale_id', $this->catScale);
            })
            ->when($this->catMineral && count($this->catMineral) > 0, function ($query) {
                $query->whereIn('weight.mineral_id', $this->catMineral);
---
select * from `minrals`
select * from `provinces`

    public function render()
    {

        return view('livewire.highscale.high-scale-report', [
            'table_data' => $this->isDataLoaded ? $this->tableData() : collect(),
            'scales' => DB::connection('scale_system')->table('scale')
                ->when(auth()->user()->position != 1, function ($query) {
                    $query->where('scale.department_id', auth()->user()->province_id);
                })
                ->get(),
            'minerals' => Mineral::all(),
            'provinces' => DB::connection('scale_system')->table('provinces')
                ->when(auth()->user()->position != 1, function ($query) {
                    $query->where('province_code', auth()->user()->province_id);
                })->get(),
            'units' => DB::connection('scale_system')->table('unit_category_details')->select('id', 'name')->get(),

        ]);
---
select `id`, `name` from `unit_category_details`
select `id`, `name` from `scale`
select * from `provinces`