app/Livewire/Highscale/ScaleDashboard.php

                ->orderBy('scale_name')
                ->get();
        } else {
            $this->table_data = DB::table('scale_system.weight')
                ->when(auth()->user()->position != 1, function ($query) {
                    $query->where('provinces.province_code', '=', auth()->user()->province_id);
                })
                ->join('scale', 'weight.scale_id', '=', 'scale.id')
                ->join('provinces', 'scale.department_id', '=', 'provinces.province_code')
                ->join('minrals', 'minrals.id', '=', 'weight.mineral_id')
                ->select(
                    'scale.name as scale_name',
                    'minrals.minral_name as mineral_name',
                    'provinces.name AS province',
                    'provinces.province_code AS province_id',

                    DB::raw('COUNT(weight.id) as cars'),
                    DB::raw('SUM(mineral_net_weight) AS total_mineral_weight'),
                    DB::raw("SUM(CASE WHEN discharge_place = 'CHECKED' THEN 200 ELSE mineral_net_weight * 10 END) as total_revenue")
                )
---
select `scale`.`name` as `scale_name`, `minrals`.`minral_name` as `mineral_name`, `provinces`.`name` as `province`, `provinces`.`province_code` as `province_id`, COUNT(weight.id) as cars, SUM(mineral_net_weight) AS total_mineral_weight, SUM(CASE WHEN discharge_place = 'CHECKED' THEN 200 ELSE mineral_net_weight * 10 END) as total_revenue from `scale_system`.`weight` inner join `scale` on `weight`.`scale_id` = `scale`.`id` inner join `provinces` on `scale`.`department_id` = `provinces`.`province_code` inner join `minrals` on `minrals`.`id` = `weight`.`mineral_id` group by `scale`.`id`, `minrals`.`id`, `provinces`.`name` order by `scale_name` asc

            $this->total_cars += $tb->cars;
        }
        if ($first == 0) {
            $scale_revenue = DB::connection('scale_system')->table('weight')
                ->when($this->selectedOption != 0, function ($query) {
                    $query->where('scale.id', $this->selectedOption);
                })
                ->when(auth()->user()->position != 1, function ($query) {
                    $query->where('provinces.province_code', '=', auth()->user()->province_id);
                })
                ->when($this->to_date !== '', function ($query) {
                    $query->whereBetween('weight.date', [$this->from_gregorianDate, $this->to_gregorianDate]);
                })
                ->leftjoin('scale', 'weight.scale_id', '=', 'scale.id')
                ->leftjoin('provinces', 'scale.department_id', '=', 'provinces.province_code')
                ->select(
                    'scale.name',
                    DB::raw('SUM(CASE WHEN discharge_place = "CHECKED" THEN 200 ELSE mineral_net_weight * 10 END) AS Total_Revenue')
                )
---
select `scale`.`name`, SUM(CASE WHEN discharge_place = "CHECKED" THEN 200 ELSE mineral_net_weight * 10 END) AS Total_Revenue from `weight` inner join `scale` on `weight`.`scale_id` = `scale`.`id` group by `scale`.`name`

            $lastDayShamsi = Jalalian::fromFormat('Y-m-d', $year . '-' . $month . '-' . $jalaliDate->getMonthDays())->format('Y-m-d');


            $revenues = DB::connection('scale_system')->table('weight')
                ->when(auth()->user()->position != 1, function ($query) {
                    $query->where('provinces.province_code', '=', auth()->user()->province_id);
                })
                ->whereBetween('weight.created_at', [$this->shamsiToGregorian($firstDayShamsi), $this->shamsiToGregorian($lastDayShamsi)])
                ->leftjoin('scale', 'weight.scale_id', '=', 'scale.id')
                ->leftjoin('provinces', 'scale.department_id', '=', 'provinces.province_code')
                ->select([
                    'scale.name',
                    'weight.mineral_id',
                    DB::raw('COUNT(weight.id) as cars'),
                    DB::raw('SUM(weight.mineral_net_weight) AS Total_Mineral_Weight'),
                    DB::raw("SUM(CASE WHEN discharge_place = 'CHECKED' THEN 200 ELSE mineral_net_weight * 10 END) as total_revenue"),
                    'weight.discharge_place',
                    'weight.discharge_place',
                ])
                ->groupBy('scale.name', 'weight.mineral_id', 'weight.discharge_place')
                ->get();
---
select `scale`.`name`, `weight`.`mineral_id`, COUNT(weight.id) as cars, SUM(weight.mineral_net_weight) AS Total_Mineral_Weight, SUM(CASE WHEN discharge_place = 'CHECKED' THEN 200 ELSE mineral_net_weight * 10 END) as total_revenue, `weight`.`discharge_place` from `weight` left join `scale` on `weight`.`scale_id` = `scale`.`id` where `weight`.`created_at` between '2024-03-20' and '2025-03-21' and year(`weight`.`created_at`) = '2024' group by `scale`.`name`, `weight`.`mineral_id`, `weight`.`discharge_place`